ALL_NAME = ['Lillian Powell', 'Brenda Bowen', 'Joseph Johnston', 'Glenn Fisher', 'Christina Horton', 'Jessica Mitchell',
            'Roger Clark', 'Daniel Cole', 'Stephen Clark', 'Betty Wright', 'James Moody', 'Anita Kelly', 'John Perry',
            'Harry Santiago', 'Robert Brooks', 'Douglas Williams', 'Sherry Allen', 'Kathryn Ruiz', 'James Wood',
            'Jerry Harper', 'Lisa Graham', 'Donald McCoy', 'Virgil Baker', 'Glenn Page', 'Rose Dunn']

ALL_PROFESSION = ['имеет два незаконченных высших образования в сфере геологии, подрабатывает в детском саду',
                  'кандидат медицинских наук, работает хирургом в частной клинике 5 лет',
                  'ветеринар со стажем более 20 лет', 'ведет видеоблог о похудении, в прошлом актриса(актер)',
                  'не закончил(-а) школу, пошел(-а) подрабатывать на стройку, '
                  'вследствие чего стал(-а) высококлассным застройщиком',
                  'лингвист с опытом работы сурдопереводчика',
                  'домохозяйка, но в прошлом шеф-повар мишленовского ресторана',
                  'получил(-а) высшее образование экономиста, отсидел(-а) за дачу взятки в особо крупном размере',
                  'вырос(-ла) в детском доме, состоял(-а) на учете за хулиганство,',
                  'основатель компании по производству и установке сантехнического оборудования',
                  'альпинист со стажем более 20 лет, состоит в объединении летних марафонцев',
                  'не закончил(-а) школу, работает продавцом в сетевом магазине',
                  'закончил(-а) педагогический институт, занимается написанием детских пособий',
                  'работает репортером, побывал(-а) в 25 странах мира',
                  'работает метеорологом 10 лет, но купил(-а) диплом об образовании',
                  'эстрадный певец(-ица), но отучился(-ась) на прикладного механика',
                  'работает барменом, но закончил(-а) курсы первой медицинской помощи',
                  'шоумен, участвовал(-а) в реалити по выживанию в дикой природе',
                  'учился(-ась) на аллерголога, но стал(-а) смотрителем зоопарка',
                  'работал(-а) спасателем МЧС, но был уволен(-а) в связи с несчастным случаем',
                  'профессиональный психолог, но имеет судимость за превышение самообороны']

ALL_BACKPACK = ['набор веревок', 'плюшевая игрушка', 'антисептик', 'определитель растений', 'компас', 'монпасье',
                'обезболивающее', 'набор для рыбалки', 'канцелярский нож', 'шариковая ручка', 'семена моркови',
                'гигиеническая помада', 'зеркальце', 'путеводитель по странам', 'книга рецептов',
                'набор для шитья (нитки + иголки)', 'бинт', 'топорик', 'фонарик', 'влажные салфетки']

ALL_HOBBY = ['увлекается древним искусством плетения и вязания из растений',
             'увлекается выращиванием растений от самых простых до экзотических', 'увлекается эзотерикой',
             'увлекается вязанием узлов различной степени сложности', 'пишет книги в жанре детектив',
             'практикует отшельничество', 'увлекается рисованием в стиле современного искусства',
             'увлекается гончарным искусством', 'увлекается дайвингом', 'снимает свой кулинарный блог',
             'собирает коллекцию пробок от бутылок вина',
             'в свободное время занимается сборкой своего автомобиля в гараже', 'обожает рыбалку',
             'занимается фотосъемкой животных в их естественной среде обитания', 'увлекается киберспортом',
             'практикует медитации и другие телесные практики', 'занимается хайкингом',
             'спасает бездомных кошек и собак', 'по вечерам играет на музыкальных инструментах в метро',
             'в свободное время ходит в тренажерный зал']

ALL_HEALTH = ['бесплодность', 'генетическая предрасположенность к раку', 'повышенная тревожность', 'аллергия на рыбу',
              'диабет', 'неправильно сросшийся перелом руки', 'остеохондроз', 'избыточная масса тела',
              'продолжительная депрессия', 'плохая свертываемость крови', 'слабое физическое развитие',
              'наркозависимость', 'йододефицит', 'острая сердечная недостаточность', 'астма', 'нехватка витамина D',
              'слабое зрение', 'различные кожные заболевания (псориаз и пр.)', 'частичная алопеция (облысение)',
              'шизофрения', 'полностью здоров', 'полностью здоров', 'полностью здоров', 'полностью здоров']

ALL_PHOBIAS = ['селахофобия - боязнь акул', 'алгофобия - боязнь боли', 'ятрофобия - боязнь врачей',
               'акрофобия - боязнь высоты', 'бронтофобия - боязнь грома', 'офидиофобия - боязнь змей',
               'клаустрофобия - боязнь замкнутых пространств', 'рипофобия - боязнь грязи',
               'эйсоптрофобия - боязнь зеркала', 'фелинофобия - боязнь кошек', 'спермофобия - боязнь микробов',
               'гематофобия - боязнь крови', 'мониторофобия - боязнь наблюдения', 'катагелофобия - боязнь насмешек',
               'энтомофобия - боязнь насмешек', 'социофобия - боязнь общества', 'скелерофобия - боязнь плохих людей',
               'танатофобия - боязнь смерти', 'некрофобия - боязнь трупов', 'пирофобия - боязнь огня']

ALL_ACTIONS = [f'У одного из жителей бункера случился внезапный приступ паники, за которым последовал сердечный приступ и остановка сердца. Это был(-а)',
               f'У одного из жителей бункера была сильнейшая фобия громких звуков, поэтому его сердце не выдержало громкого удара бункера о скалу. Это был(-а)',
               f'По самой несчастливой случайности в кровать к одному из жителей бункера заполз самый ядовитый паук и убил своим ядом. Это был(-а)',
               f'Из-за сильной тряски на голову одному из жителей бункера упала тяжелая статуэтка, пробив ему голову. Это был(-а)',
               f'Один из жителей бункера по незнанию съел ядовитую ягоду и умер во сне. Это был(-а)',
               f'У одного из жителей бункера внезапно проявились все пищевые аллергии, поэтому игрок умер голода. Это был(-а)',
               f'Один из жителей бункера вышел из него, услышав голоса за его пределами. Но оказалось, что это были лишь слуховые галлюцинации и игрок умер от радиации. Это был(-а)',
               f'У одного из жителей бункера развилась патология почечной недостаточности и он умер от гиперкалиемии. Это был(-а)']