ALL_NAME = ['Lillian Powell', 'Brenda Bowen', 'Joseph Johnston', 'Glenn Fisher', 'Christina Horton', 'Jessica Mitchell',
            'Roger Clark', 'Daniel Cole', 'Stephen Clark', 'Betty Wright']

ALL_PROFESSION = ['имеет два незаконченных высших образования в сфере геологии, подрабатывает в детском саду',
                  'кандидат медицинских наук, работает хирургом в частной клинике 5 лет',
                  'ветеринар со стажем более 20 лет', 'ведет видеоблог о похудении, в прошлом актриса(актер)',
                  'не закончил(-а) школу, пошел(-а) подрабатывать на стройку, '
                  'вследствие чего стал(-а) высококлассным застройщиком',
                  'лингвист с опытом работы сурдопереводчика',
                  'домохозяйка, но в прошлом шеф-повар мишленовского ресторана',
                  'получил(-а) высшее образование экономиста, отсидел(-а) за дачу взятки в особо крупном размере',
                  'вырос(-ла) в детском доме, состоял(-а) на учете за хулиганство,',
                  'основатель компании по производству и установке сантехнического оборудования',
                  'альпинист со стажем более 20 лет, состоит в объединении летних марафонцев',
                  'не закончил(-а) школу, работает продавцом в сетевом магазине',
                  'закончил(-а) педагогический институт, занимается написанием детских пособий',
                  'работает репортером, побывал(-а) в 25 странах мира',
                  'работает метеорологом 10 лет, но купил(-а) диплом об образовании',
                  'эстрадный певец(-ица), но отучился(-ась) на прикладного механика',
                  'работает барменом, но закончил(-а) курсы первой медицинской помощи',
                  'шоумен, участвовал(-а) в реалити по выживанию в дикой природе',
                  'учился(-ась) на аллерголога, но стал(-а) смотрителем зоопарка',
                  'работал(-а) спасателем МЧС, но был уволен(-а) в связи с несчастным случаем',
                  'профессиональный психолог, но имеет судимость за превышение самообороны']

ALL_BACKPACK = ['набор веревок', 'плюшевая игрушка', 'антисептик', 'определитель растений', 'компас', 'монпасье',
                'обезболивающее', 'набор для рыбалки', 'канцелярский нож', 'шариковая ручка', 'семена моркови',
                'гигиеническая помада', 'зеркальце', 'путеводитель по странам', 'книга рецептов',
                'набор для шитья (нитки + иголки)', 'бинт', 'топорик', 'фонарик', 'влажные салфетки']

ALL_HOBBY = ['увлекается древним искусством плетения и вязания из растений',
             'увлекается выращиванием растений от самых простых до экзотических', 'увлекается эзотерикой',
             'увлекается вязанием узлов различной степени сложности', 'пишет книги в жанре детектив',
             'практикует отшельничество', 'увлекается рисованием в стиле современного искусства',
             'увлекается гончарным искусством', 'увлекается дайвингом', 'снимает свой кулинарный блог',
             'собирает коллекцию пробок от бутылок вина',
             'в свободное время занимается сборкой своего автомобиля в гараже', 'обожает рыбалку',
             'занимается фотосъемкой животных в их естественной среде обитания', 'увлекается киберспортом',
             'практикует медитации и другие телесные практики', 'занимается хайкингом',
             'спасает бездомных кошек и собак', 'по вечерам играет на музыкальных инструментах в метро',
             'в свободное время ходит в тренажерный зал']

ALL_HEALTH = ['бесплодность', 'генетическая предрасположенность к раку', 'повышенная тревожность', 'аллергия на рыбу',
              'диабет', 'неправильно сросшийся перелом руки', 'остеохондроз', 'избыточная масса тела',
              'продолжительная депрессия', 'плохая свертываемость крови', 'слабое физическое развитие',
              'наркозависимость', 'йододефицит', 'острая сердечная недостаточность', 'астма', 'нехватка витамина D',
              'слабое зрение', 'различные кожные заболевания (псориаз и пр.)', 'частичная алопеция (облысение)',
              'шизофрения', 'полностью здоров', 'полностью здоров', 'полностью здоров', 'полностью здоров']

ALL_PHOBIAS = ['селахофобия - боязнь акул', 'алгофобия - боязнь боли', 'ятрофобия - боязнь врачей',
               'акрофобия - боязнь высоты', 'бронтофобия - боязнь грома', 'офидиофобия - боязнь змей',
               'клаустрофобия - боязнь замкнутых пространств', 'рипофобия - боязнь грязи',
               'эйсоптрофобия - боязнь зеркала', 'фелинофобия - боязнь кошек', 'спермофобия - боязнь микробов',
               'гематофобия - боязнь крови', 'мониторофобия - боязнь наблюдения', 'катагелофобия - боязнь насмешек',
               'энтомофобия - боязнь насмешек', 'социофобия - боязнь общества', 'скелерофобия - боязнь плохих людей',
               'танатофобия - боязнь смерти', 'некрофобия - боязнь трупов', 'пирофобия - боязнь огня']

ALL_ACTIONS = [f'У одного из жителей бункера случился внезапный приступ паники, за которым последовал сердечный приступ и остановка сердца. Это был(-а)',
               f'У одного из жителей бункера была сильнейшая фобия громких звуков, поэтому его сердце не выдержало громкого удара бункера о скалу. Это был(-а)',
               f'По самой несчастливой случайности в кровать к одному из жителей бункера заполз самый ядовитый паук и убил своим ядом. Это был(-а)',
               f'Из-за сильной тряски на голову одному из жителей бункера упала тяжелая статуэтка, пробив ему голову. Это был(-а)',
               f'Один из жителей бункера по незнанию съел ядовитую ягоду и умер во сне. Это был(-а)',
               f'У одного из жителей бункера внезапно проявились все пищевые аллергии, поэтому игрок умер голода. Это был(-а)',
               f'Один из жителей бункера вышел из него, услышав голоса за его пределами. Но оказалось, что это были лишь слуховые галлюцинации и игрок умер от радиации. Это был(-а)',
               f'У одного из жителей бункера развилась патология почечной недостаточности и он умер от гиперкалиемии. Это был(-а)']

HELLO = 'Здравствуйте, дорогие участники. К сожалению, случилось то, чего боялось все человечество - апокалипсис\n'
'Но именно у вас есть возможность дать человечеству новый шанс на новую жизнь\n'
'Сейчас вы в пути в ваш новый дом, но пройти этот путь до конца сможет только 5 человек\n'
'В течении игры вам придется решать, кто останется с вами, а кто нет. Для определения ваших ролей вам\n'
'необходимо далее войти с ваших телефонов в бот и нажать кнопку получить роль.\n '
' \n'

A_TEXT_1 = 'Если вы прочитали инструкцию, то введите + с клавиатуры: '
A_TEXT_2 = 'Вернитесь в начало игры и выполните условия'

B_TEXT_1 = 'Если вы успешно получили роль, то введите + с клавиатуры: '
B_TEXT_2 = ' \n'
'Как вы уже знаете, до конца дойдет только 5 человек. Сейчас у вас будет ровно две минуты, чтобы решить,\n'
'кто первый покинет бункер. Обсудите в реальной жизни свои роли и аргументируйте почему остаться должны именно вы,\n'
'а кто должен уйти. По истечении времени вам будет необходимо ввести свой выбор. Если вы не сможете принять единое решение,\n'
'то введите вместо выбора знак минус.\n'
Q_TEXT_1 = 'Если вы готовы начать, введите +: '
TIME = 'Время пошло'
REM = 'Вернитесь в начало игры и выполните условия'
THANK = 'спасибо за игру'

END_1 = 'Поздравляем! Вы успешно добрались до конца и смогли принять коллективные решения. А что из этого вышло\n'
'мы узнаем лишь через время. Надеемся, что в этот раз человечество справится!'
END_2 = 'Поздравляем! Вы успешно добрались до конца. А что ждет вас дальше, \n'
'мы узнаем лишь через время. Надеемся, что в этот раз человечество справится!'

KIK = 'Введите имя персонажа, который должен покинуть бункер или минус, если вы не приняли решение: '
HOB = ' \n'
'Настало время узнать друг друга лучше. Вам стала доступна информация о хобби \n'
'каждого из вас. Для её получения вновь откройте бот в своих телефонахи дествуйте по инструкциям там'

D_TEXT_1 = 'Если вы успешно получили ваше хобби, то введите + с клавиатуры: '
D_TEXT_2 = ' \n'
'Время поджимает, прибытие уже скоро. Необходимо совершить очередной выбор об изгнании следующего человека.'

F_TEXT_1 = ' \n'
'У каждого есть свои страхи, верно ? Вам стала доступна информация о фобии каждого из вас. Для её получения вновь \n'
'откройте бот в своих телефонах и дествуйте по инструкциям там'
F_TEXT_2 = 'Если вы успешно получили вашу фобию, то введите + с клавиатуры: '
F_TEXT_3 = ' \n'
'Настало время посовещаться и совершить очередной выбор об изгнании следующего человека.'

H_TEXT_1 = ' \n'
'Может быть кто-то из вас прихватил что-то полезное с собой? Вам стала доступна информация о вещи в рюкзаке каждого из вас. '
'Для ее получения вновь откройте бот в своем телефоне и действуйте по инструкции'
H_TEXT_2 = 'Если вы успешно получили вашу вещь в рюкзаке, то введите + с клавиатуры: '
H_TEXT_3 = ' \n'
'Необходимо совершить очередной выбор об изгнании следующего человека.'

M_TEXT_1 = ' \n'
'Одна из самых важных составляющих жизни - здоровье. Вам стала доступна информация о здоровье каждого из вас. '
'Для ее получения вновь откройте бот в своем телефоне и действуйте по инструкции'
M_TEXT_2 = 'Если вы успешно получили ваше здоровье, то введите + с клавиатуры: '
M_TEXT_3 = ' \n'
'Новый дом уже ждет вас, но необходимо совершить очередной выбор об изгнании следующего человека.'
